7767517
199 215
Input            0                        0 1 0
Convolution      334                      1 1 0 334 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=432
BatchNorm        335                      1 1 334 335 0=16
HardSwish        341                      1 1 335 341 0=1.666667e-01 1=5.000000e-01
Convolution      342                      1 1 341 342 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=256
BatchNorm        343                      1 1 342 343 0=16
ReLU             344                      1 1 343 344
ConvolutionDepthWise 345                      1 1 344 345 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=144 7=16
BatchNorm        346                      1 1 345 346 0=16
ReLU             347                      1 1 346 347
Convolution      348                      1 1 347 348 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=256
BatchNorm        349                      1 1 348 349 0=16
Split            splitncnn_0              1 2 349 349_splitncnn_0 349_splitncnn_1
Pooling          350                      1 1 349_splitncnn_1 350 0=1 4=1
Convolution      351                      1 1 350 351 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=64
BatchNorm        352                      1 1 351 352 0=4
ReLU             353                      1 1 352 353
Convolution      354                      1 1 353 354 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=64
BatchNorm        355                      1 1 354 355 0=16
HardSigmoid      360                      1 1 355 360 0=1.666667e-01 1=5.000000e-01
BinaryOp         361                      2 1 349_splitncnn_0 360 361 0=2
Convolution      362                      1 1 361 362 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1152
BatchNorm        363                      1 1 362 363 0=72
ReLU             364                      1 1 363 364
ConvolutionDepthWise 365                      1 1 364 365 0=72 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=648 7=72
BatchNorm        366                      1 1 365 366 0=72
ReLU             367                      1 1 366 367
Convolution      368                      1 1 367 368 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1728
BatchNorm        369                      1 1 368 369 0=24
Split            splitncnn_1              1 2 369 369_splitncnn_0 369_splitncnn_1
Convolution      370                      1 1 369_splitncnn_1 370 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2112
BatchNorm        371                      1 1 370 371 0=88
ReLU             372                      1 1 371 372
ConvolutionDepthWise 373                      1 1 372 373 0=88 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=792 7=88
BatchNorm        374                      1 1 373 374 0=88
ReLU             375                      1 1 374 375
Convolution      376                      1 1 375 376 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2112
BatchNorm        377                      1 1 376 377 0=24
BinaryOp         378                      2 1 377 369_splitncnn_0 378 0=0
Convolution      379                      1 1 378 379 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        380                      1 1 379 380 0=96
HardSwish        386                      1 1 380 386 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 387                      1 1 386 387 0=96 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=0 6=2400 7=96
BatchNorm        388                      1 1 387 388 0=96
HardSwish        394                      1 1 388 394 0=1.666667e-01 1=5.000000e-01
Convolution      395                      1 1 394 395 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3840
BatchNorm        396                      1 1 395 396 0=40
Split            splitncnn_2              1 2 396 396_splitncnn_0 396_splitncnn_1
Pooling          397                      1 1 396_splitncnn_1 397 0=1 4=1
Convolution      398                      1 1 397 398 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        399                      1 1 398 399 0=10
ReLU             400                      1 1 399 400
Convolution      401                      1 1 400 401 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        402                      1 1 401 402 0=40
HardSigmoid      407                      1 1 402 407 0=1.666667e-01 1=5.000000e-01
BinaryOp         408                      2 1 396_splitncnn_0 407 408 0=2
Split            splitncnn_3              1 2 408 408_splitncnn_0 408_splitncnn_1
Convolution      409                      1 1 408_splitncnn_1 409 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=9600
BatchNorm        410                      1 1 409 410 0=240
HardSwish        416                      1 1 410 416 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 417                      1 1 416 417 0=240 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=6000 7=240
BatchNorm        418                      1 1 417 418 0=240
HardSwish        424                      1 1 418 424 0=1.666667e-01 1=5.000000e-01
Convolution      425                      1 1 424 425 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=9600
BatchNorm        426                      1 1 425 426 0=40
Split            splitncnn_4              1 2 426 426_splitncnn_0 426_splitncnn_1
Pooling          427                      1 1 426_splitncnn_1 427 0=1 4=1
Convolution      428                      1 1 427 428 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        429                      1 1 428 429 0=10
ReLU             430                      1 1 429 430
Convolution      431                      1 1 430 431 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        432                      1 1 431 432 0=40
HardSigmoid      437                      1 1 432 437 0=1.666667e-01 1=5.000000e-01
BinaryOp         438                      2 1 426_splitncnn_0 437 438 0=2
BinaryOp         439                      2 1 438 408_splitncnn_0 439 0=0
Split            splitncnn_5              1 2 439 439_splitncnn_0 439_splitncnn_1
Convolution      440                      1 1 439_splitncnn_1 440 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=9600
BatchNorm        441                      1 1 440 441 0=240
HardSwish        447                      1 1 441 447 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 448                      1 1 447 448 0=240 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=6000 7=240
BatchNorm        449                      1 1 448 449 0=240
HardSwish        455                      1 1 449 455 0=1.666667e-01 1=5.000000e-01
Convolution      456                      1 1 455 456 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=9600
BatchNorm        457                      1 1 456 457 0=40
Split            splitncnn_6              1 2 457 457_splitncnn_0 457_splitncnn_1
Pooling          458                      1 1 457_splitncnn_1 458 0=1 4=1
Convolution      459                      1 1 458 459 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        460                      1 1 459 460 0=10
ReLU             461                      1 1 460 461
Convolution      462                      1 1 461 462 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        463                      1 1 462 463 0=40
HardSigmoid      468                      1 1 463 468 0=1.666667e-01 1=5.000000e-01
BinaryOp         469                      2 1 457_splitncnn_0 468 469 0=2
BinaryOp         470                      2 1 469 439_splitncnn_0 470 0=0
Split            splitncnn_7              1 2 470 470_splitncnn_0 470_splitncnn_1
Convolution      471                      1 1 470_splitncnn_1 471 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4800
BatchNorm        472                      1 1 471 472 0=120
HardSwish        478                      1 1 472 478 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 479                      1 1 478 479 0=120 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=3000 7=120
BatchNorm        480                      1 1 479 480 0=120
HardSwish        486                      1 1 480 486 0=1.666667e-01 1=5.000000e-01
Convolution      487                      1 1 486 487 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=5760
BatchNorm        488                      1 1 487 488 0=48
Split            splitncnn_8              1 2 488 488_splitncnn_0 488_splitncnn_1
Pooling          489                      1 1 488_splitncnn_1 489 0=1 4=1
Convolution      490                      1 1 489 490 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=576
BatchNorm        491                      1 1 490 491 0=12
ReLU             492                      1 1 491 492
Convolution      493                      1 1 492 493 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=576
BatchNorm        494                      1 1 493 494 0=48
HardSigmoid      499                      1 1 494 499 0=1.666667e-01 1=5.000000e-01
BinaryOp         500                      2 1 488_splitncnn_0 499 500 0=2
Convolution      501                      1 1 470_splitncnn_0 501 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1920
BatchNorm        502                      1 1 501 502 0=48
BinaryOp         503                      2 1 500 502 503 0=0
Split            splitncnn_9              1 2 503 503_splitncnn_0 503_splitncnn_1
Convolution      504                      1 1 503_splitncnn_1 504 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6912
BatchNorm        505                      1 1 504 505 0=144
HardSwish        511                      1 1 505 511 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 512                      1 1 511 512 0=144 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=3600 7=144
BatchNorm        513                      1 1 512 513 0=144
HardSwish        519                      1 1 513 519 0=1.666667e-01 1=5.000000e-01
Convolution      520                      1 1 519 520 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6912
BatchNorm        521                      1 1 520 521 0=48
Split            splitncnn_10             1 2 521 521_splitncnn_0 521_splitncnn_1
Pooling          522                      1 1 521_splitncnn_1 522 0=1 4=1
Convolution      523                      1 1 522 523 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=576
BatchNorm        524                      1 1 523 524 0=12
ReLU             525                      1 1 524 525
Convolution      526                      1 1 525 526 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=576
BatchNorm        527                      1 1 526 527 0=48
HardSigmoid      532                      1 1 527 532 0=1.666667e-01 1=5.000000e-01
BinaryOp         533                      2 1 521_splitncnn_0 532 533 0=2
BinaryOp         534                      2 1 533 503_splitncnn_0 534 0=0
Convolution      535                      1 1 534 535 0=288 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13824
BatchNorm        536                      1 1 535 536 0=288
HardSwish        542                      1 1 536 542 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 543                      1 1 542 543 0=288 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=0 6=7200 7=288
BatchNorm        544                      1 1 543 544 0=288
HardSwish        550                      1 1 544 550 0=1.666667e-01 1=5.000000e-01
Convolution      551                      1 1 550 551 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=27648
BatchNorm        552                      1 1 551 552 0=96
Split            splitncnn_11             1 2 552 552_splitncnn_0 552_splitncnn_1
Pooling          553                      1 1 552_splitncnn_1 553 0=1 4=1
Convolution      554                      1 1 553 554 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        555                      1 1 554 555 0=24
ReLU             556                      1 1 555 556
Convolution      557                      1 1 556 557 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        558                      1 1 557 558 0=96
HardSigmoid      563                      1 1 558 563 0=1.666667e-01 1=5.000000e-01
BinaryOp         564                      2 1 552_splitncnn_0 563 564 0=2
Split            splitncnn_12             1 2 564 564_splitncnn_0 564_splitncnn_1
Convolution      565                      1 1 564_splitncnn_1 565 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        566                      1 1 565 566 0=576
HardSwish        572                      1 1 566 572 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 573                      1 1 572 573 0=576 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=14400 7=576
BatchNorm        574                      1 1 573 574 0=576
HardSwish        580                      1 1 574 580 0=1.666667e-01 1=5.000000e-01
Convolution      581                      1 1 580 581 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        582                      1 1 581 582 0=96
Split            splitncnn_13             1 2 582 582_splitncnn_0 582_splitncnn_1
Pooling          583                      1 1 582_splitncnn_1 583 0=1 4=1
Convolution      584                      1 1 583 584 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        585                      1 1 584 585 0=24
ReLU             586                      1 1 585 586
Convolution      587                      1 1 586 587 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        588                      1 1 587 588 0=96
HardSigmoid      593                      1 1 588 593 0=1.666667e-01 1=5.000000e-01
BinaryOp         594                      2 1 582_splitncnn_0 593 594 0=2
BinaryOp         595                      2 1 594 564_splitncnn_0 595 0=0
Split            splitncnn_14             1 2 595 595_splitncnn_0 595_splitncnn_1
Convolution      596                      1 1 595_splitncnn_1 596 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        597                      1 1 596 597 0=576
HardSwish        603                      1 1 597 603 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise 604                      1 1 603 604 0=576 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=14400 7=576
BatchNorm        605                      1 1 604 605 0=576
HardSwish        611                      1 1 605 611 0=1.666667e-01 1=5.000000e-01
Convolution      612                      1 1 611 612 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        613                      1 1 612 613 0=96
Split            splitncnn_15             1 2 613 613_splitncnn_0 613_splitncnn_1
Pooling          614                      1 1 613_splitncnn_1 614 0=1 4=1
Convolution      615                      1 1 614 615 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        616                      1 1 615 616 0=24
ReLU             617                      1 1 616 617
Convolution      618                      1 1 617 618 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        619                      1 1 618 619 0=96
HardSigmoid      624                      1 1 619 624 0=1.666667e-01 1=5.000000e-01
BinaryOp         625                      2 1 613_splitncnn_0 624 625 0=2
BinaryOp         626                      2 1 625 595_splitncnn_0 626 0=0
Convolution      627                      1 1 626 627 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        628                      1 1 627 628 0=576
HardSwish        634                      1 1 628 634 0=1.666667e-01 1=5.000000e-01
Padding          635                      1 1 634 635 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00
Pooling          636                      1 1 635 636 0=1 1=7 11=7 2=7 12=7 3=0 13=0 14=0 15=0 5=1 6=0
Flatten          644                      1 1 636 644
InnerProduct     645                      1 1 644 645 0=1280 1=1 2=737280
BatchNorm        648                      1 1 645 648 0=1280
HardSwish        654                      1 1 648 654 0=1.666667e-01 1=5.000000e-01
InnerProduct     feature                  1 1 654 feature 0=512 1=1 2=655360
